# SetGetLocalPathForOpenCallback Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevitLinkOperations..::..SetGetLocalPathForOpenCallback Method
RevitLinkOperations Class See Also
---
Sets the IGetLocalPathForOpenCallback that will support the "Open (and Unload)" command for Revit links obtained from an IExternalResourceServer.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public void SetGetLocalPathForOpenCallback(
	IGetLocalPathForOpenCallback makeLocalCopyForOpen
)
```

Visual Basic
---
```text
Public Sub SetGetLocalPathForOpenCallback ( _
	makeLocalCopyForOpen As IGetLocalPathForOpenCallback _
)
```

Visual C++
---
```text
public:
void SetGetLocalPathForOpenCallback(
	IGetLocalPathForOpenCallback^ makeLocalCopyForOpen
)
```

# ### Parameters
makeLocalCopyForOpen
    Type: Autodesk.Revit.DB..::..IGetLocalPathForOpenCallback The IGetLocalPathForOpenCallback that will support the "Open (and Unload)" command.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RevitLinkOperations Class
Autodesk.Revit.DB Namespace